# TechNest Assignment 4

In [1]:
%load_ext sql

In [2]:
%sql sqlite://

## Q1.Fetch the number of employees working in different dept

***create table emp(id number,name varchar2(50),designation varchar2(50),salary number);<br>
insert into emp values(1,'Aman','HOD',400);<br>
insert into emp values(2,'Rajesh','HOD',500);<br>
insert into emp values(7,'Rakesh','HOD',700);<br>
insert into emp values(3,'Karan','Professor',800);<br>
insert into emp values(4,'Henry','Professor',300);<br>
insert into emp values(5,'Kunal','Instructor',400);<br>
insert into emp values(6,'Yusuf','Instructor',200);***

In [3]:
%sql create table emp(id number,name varchar2(50),designation varchar2(50),salary number);insert into emp values(1,'Aman','HOD',400);insert into emp values(2,'Rajesh','HOD',500);insert into emp values(7,'Rakesh','HOD',700);insert into emp values(3,'Karan','Professor',800);insert into emp values(4,'Henry','Professor',300);insert into emp values(5,'Kunal','Instructor',400);insert into emp values(6,'Yusuf','Instructor',200);
%sql select * from emp;

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
 * sqlite://
Done.

[(1, 'Aman', 'HOD', 400),
 (2, 'Rajesh', 'HOD', 500),
 (7, 'Rakesh', 'HOD', 700),
 (3, 'Karan', 'Professor', 800),
 (4, 'Henry', 'Professor', 300),
 (5, 'Kunal', 'Instructor', 400),
 (6, 'Yusuf', 'Instructor', 200)]

In [6]:
# solution
%sql select designation as dept,count(1) from emp group by designation;

 * sqlite://
Done.

[('HOD', 3), ('Instructor', 2), ('Professor', 2)]

In [8]:
%sql drop table emp;

 * sqlite://
Done.

[]

<hr>

## Q2.Fetch the number of employees earning salary greater than 500

***create table emp(id number,name varchar2(50),designation varchar2(50),salary number);<br>
insert into emp values(1,'Aman','HOD',400);<br>
insert into emp values(2,'Rajesh','HOD',500);<br>
insert into emp values(7,'Rakesh','HOD',700);<br>
insert into emp values(3,'Karan','Professor',800);<br>
insert into emp values(4,'Henry','Professor',300);<br>
insert into emp values(5,'Kunal','Instructor',400);<br>
insert into emp values(6,'Yusuf','Instructor',200);***

In [9]:
%sql create table emp(id number,name varchar2(50),designation varchar2(50),salary number);insert into emp values(1,'Aman','HOD',400);insert into emp values(2,'Rajesh','HOD',500);insert into emp values(7,'Rakesh','HOD',700);insert into emp values(3,'Karan','Professor',800);insert into emp values(4,'Henry','Professor',300);insert into emp values(5,'Kunal','Instructor',400);insert into emp values(6,'Yusuf','Instructor',200);
%sql select * from emp;

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
 * sqlite://
Done.

[(1, 'Aman', 'HOD', 400),
 (2, 'Rajesh', 'HOD', 500),
 (7, 'Rakesh', 'HOD', 700),
 (3, 'Karan', 'Professor', 800),
 (4, 'Henry', 'Professor', 300),
 (5, 'Kunal', 'Instructor', 400),
 (6, 'Yusuf', 'Instructor', 200)]

In [10]:
# solution
%sql select count(salary) from emp where salary > 500;

 * sqlite://
Done.

[(2,)]

In [11]:
%sql drop table emp;

 * sqlite://
Done.

[]

<hr>

## Q3.Explain the output of count(*),count(mgrid),count('mgrid'),count(empid) and count(empname).

***Create table employee(empid number,empname varchar2(10),Mgrid number);<br>
insert into employee values(1,'A',4);<br>
insert into employee values(2,'B',5);<br>
insert into employee values(3,'C',6);<br>
insert into employee values(4,'D',5);<br>
insert into employee values(5,'E',null);<br>
insert into employee values(6,'F',null);***

In [13]:
%sql Create table employee(empid number,empname varchar2(10),Mgrid number);insert into employee values(1,'A',4);insert into employee values(2,'B',5);insert into employee values(3,'C',6);insert into employee values(4,'D',5);insert into employee values(5,'E',null);insert into employee values(6,'F',null);
%sql select * from employee;

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
 * sqlite://
Done.

[(1, 'A', 4),
 (2, 'B', 5),
 (3, 'C', 6),
 (4, 'D', 5),
 (5, 'E', None),
 (6, 'F', None)]

In [15]:
# solution 
%sql select count(*),count(mgrid),count('mgrid'),count(empid),count(empname) from employee;

#count(*)-->count(1)-->count(8056187685)-->count(-1)
#count(*)==>count(any number)==Total count of records in a table
#count(string)==>count(*)
#-----------summary--------
#count(*)==>count(any number)==>count(any string)==Total count of records in a table
#--------------------------
#count(1)
#---------------------

 * sqlite://
Done.

[(6, 4, 6, 6, 6)]

In [16]:
%sql drop table employee;

 * sqlite://
Done.

[]

<hr>

## Q4.Write an SQL query to find if NULL record exists in mgrid column.

***Create table employee(empid number,empname varchar2(10),Mgrid number);<br>
insert into employee values(1,'A',4);<br>
insert into employee values(2,'B',5);<br>
insert into employee values(3,'C',6);<br>
insert into employee values(4,'D',5);<br>
insert into employee values(5,'E',null);<br>
insert into employee values(6,'F',null);***

In [26]:
%sql Create table employee(empid number,empname varchar2(10),Mgrid number);insert into employee values(1,'A',4);insert into employee values(2,'B',5);insert into employee values(3,'C',6);insert into employee values(4,'D',5);insert into employee values(5,'E',null);insert into employee values(6,'F',null);
%sql select * from employee;

 * sqlite://
Done.

[(1, 'A', 4),
 (2, 'B', 5),
 (3, 'C', 6),
 (4, 'D', 5),
 (5, 'E', None),
 (6, 'F', None)]

In [38]:
%sql select mgrid,case when mgrid is null then "True" else "False" end as status from employee;

 * sqlite://
Done.

[(4, 0), (5, 0), (6, 0), (5, 0), (None, 1), (None, 1)]

In [39]:
%sql drop table employee;

 * sqlite://
Done.

[]

<hr>

## Q5.Write an sql query to find the total number of investment done by each investor.

***create table investor1(investorname varchar2(40),sector varchar2(50));<br>
insert into investor1 values ('Ashneer','Food and Beverages');<br>
insert into investor1 values ('Anupam','Automobile');<br>
insert into investor1 values ('Piyush','Tech');<br>
insert into investor1 values ('Namita','Food and Beverages');<br>
insert into investor1 values ('Aman','Food and Beverages');<br>
insert into investor1 values ('Namita','Automobile');<br>
insert into investor1 values ('Piyush','Energy and Utility');<br>
insert into investor1 values ('Vineeta','Food and Beverages');***

In [40]:
%sql create table investor1(investorname varchar2(40),sector varchar2(50));insert into investor1 values ('Ashneer','Food and Beverages');insert into investor1 values ('Anupam','Automobile');insert into investor1 values ('Piyush','Tech');insert into investor1 values ('Namita','Food and Beverages');insert into investor1 values ('Aman','Food and Beverages');insert into investor1 values ('Namita','Automobile');insert into investor1 values ('Piyush','Energy and Utility');insert into investor1 values ('Vineeta','Food and Beverages');
%sql select * from investor1;

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
 * sqlite://
Done.

[('Ashneer', 'Food and Beverages'),
 ('Anupam', 'Automobile'),
 ('Piyush', 'Tech'),
 ('Namita', 'Food and Beverages'),
 ('Aman', 'Food and Beverages'),
 ('Namita', 'Automobile'),
 ('Piyush', 'Energy and Utility'),
 ('Vineeta', 'Food and Beverages')]

In [49]:
# solution
%sql select investorname as Name,count('Investments') from investor1 group by investorname;

 * sqlite://
Done.

[('Aman', 1),
 ('Anupam', 1),
 ('Ashneer', 1),
 ('Namita', 2),
 ('Piyush', 2),
 ('Vineeta', 1)]

In [50]:
%sql drop table investor1;

 * sqlite://
Done.

[]

<hr>

## Q6.Write a SQL query to fetch department wise count of employees.

***Create table Dept(Empid number,Empname varchar2(10),Dept varchar2(10));<br>
insert into dept values(1,'A','HR');<br>
insert into dept values(2,'B','HR');<br>
insert into dept values(3,'C','SALES');<br>
insert into dept values(4,'D','SALES');<br>
insert into dept values(5,'E','SALES');<br>
insert into dept values(6,'F',NULL);<br>
insert into dept values(7,'G',NULL);***

In [92]:
%sql Create table Dept(Empid number,Empname varchar2(10),Dept varchar2(10));insert into dept values(1,'A','HR');insert into dept values(2,'B','HR');insert into dept values(3,'C','SALES');insert into dept values(4,'D','SALES');insert into dept values(5,'E','SALES');insert into dept values(6,'F',NULL);insert into dept values(7,'G',NULL);
%sql select * from dept;

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
 * sqlite://
Done.

[(1, 'A', 'HR'),
 (2, 'B', 'HR'),
 (3, 'C', 'SALES'),
 (4, 'D', 'SALES'),
 (5, 'E', 'SALES'),
 (6, 'F', None),
 (7, 'G', None)]

In [96]:
# solution
%sql select dept,count(*) as '# of Employees' from dept group by dept;

 * sqlite://
Done.

[(None, 2), ('HR', 2), ('SALES', 3)]

In [97]:
%sql drop table dept;

 * sqlite://
Done.

[]

<hr>

## Q7.Write a SQL query to find the total number of students gender wise.

***create table stud(studid number,studname varchar2(20),Gender varchar2(5));<br>
insert into stud values(1,'Bilal','M');<br>
insert into stud values(2,'Suresh','M');<br>
insert into stud values(3,'Aman','M');<br>
insert into stud values(4,'Swati','F');<br>
insert into stud values(5,'Saurabh','M');<br>
insert into stud values(6,'Abdul','M');<br>
insert into stud values(7,'Ankit','M');<br>
insert into stud values(8,'Shruti','F');<br>
insert into stud values(9,'Ahmed','M');<br>
insert into stud values(10,'Anup','M');<br>
insert into stud values(11,'Rakesh','M');<br>
insert into stud values(12,'Neha','F');<br>
insert into stud values(13,'Suresh','M');<br>
insert into stud values(14,'Mukesh','M');<br>
insert into stud values(15,'Majid','M');<br>
insert into stud values(16,'Priyanka','F');***

In [57]:
%sql create table stud(studid number,studname varchar2(20),Gender varchar2(5));insert into stud values(1,'Bilal','M');insert into stud values(2,'Suresh','M');insert into stud values(3,'Aman','M');insert into stud values(4,'Swati','F');insert into stud values(5,'Saurabh','M');insert into stud values(6,'Abdul','M');insert into stud values(7,'Ankit','M');insert into stud values(8,'Shruti','F');insert into stud values(9,'Ahmed','M');insert into stud values(10,'Anup','M');insert into stud values(11,'Rakesh','M');insert into stud values(12,'Neha','F');insert into stud values(13,'Suresh','M');insert into stud values(14,'Mukesh','M');insert into stud values(15,'Majid','M');insert into stud values(16,'Priyanka','F');
%sql select * from stud;

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
 * sqlite://
Done.

[(1, 'Bilal', 'M'),
 (2, 'Suresh', 'M'),
 (3, 'Aman', 'M'),
 (4, 'Swati', 'F'),
 (5, 'Saurabh', 'M'),
 (6, 'Abdul', 'M'),
 (7, 'Ankit', 'M'),
 (8, 'Shruti', 'F'),
 (9, 'Ahmed', 'M'),
 (10, 'Anup', 'M'),
 (11, 'Rakesh', 'M'),
 (12, 'Neha', 'F'),
 (13, 'Suresh', 'M'),
 (14, 'Mukesh', 'M'),
 (15, 'Majid', 'M'),
 (16, 'Priyanka', 'F')]

In [61]:
%sql select gender,count(1) from stud group by gender;

 * sqlite://
Done.

[('F', 4), ('M', 12)]

In [62]:
%sql drop table stud;

 * sqlite://
Done.

[]

<hr>

## Q8. Write an SQL query to fetch the number of students Passed or Failed.

***Create table student(id number,name varchar2(10),subject varchar2(10),result varchar2(10));<br>
insert into student values(1,'A','Maths','Pass');<br>
insert into student values(1,'A','Phy','Pass');<br>
insert into student values(1,'A','Chem','Fail');<br>
insert into student values(1,'A','Chem','Fail');<br>
insert into student values(2,'B','Maths','Pass');<br>
insert into student values(2,'B','Phy','Fail');<br>
insert into student values(2,'B','Chem','Fail');<br>
insert into student values(3,'C','Maths','Pass');<br>
insert into student values(3,'C','Phy','Pass');<br>
insert into student values(3,'C','Chem','Fail');***

In [63]:
%sql Create table student(id number,name varchar2(10),subject varchar2(10),result varchar2(10));insert into student values(1,'A','Maths','Pass');insert into student values(1,'A','Phy','Pass');insert into student values(1,'A','Chem','Fail');insert into student values(1,'A','Chem','Fail');insert into student values(2,'B','Maths','Pass');insert into student values(2,'B','Phy','Fail');insert into student values(2,'B','Chem','Fail');insert into student values(3,'C','Maths','Pass');insert into student values(3,'C','Phy','Pass');insert into student values(3,'C','Chem','Fail');
%sql select * from student;

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
 * sqlite://
Done.

[(1, 'A', 'Maths', 'Pass'),
 (1, 'A', 'Phy', 'Pass'),
 (1, 'A', 'Chem', 'Fail'),
 (1, 'A', 'Chem', 'Fail'),
 (2, 'B', 'Maths', 'Pass'),
 (2, 'B', 'Phy', 'Fail'),
 (2, 'B', 'Chem', 'Fail'),
 (3, 'C', 'Maths', 'Pass'),
 (3, 'C', 'Phy', 'Pass'),
 (3, 'C', 'Chem', 'Fail')]

In [64]:
%sql select result,count(1) from student group by result;

 * sqlite://
Done.

[('Fail', 5), ('Pass', 5)]

In [65]:
%sql drop table student;

 * sqlite://
Done.

[]

<hr>

## Q9.Write a query to display 
***a)the total count of records,
b)total count of records with subject as Maths,<br>
c)total count of records with subject as Phy,<br>
d)total count of records with subject as Chem,<br>
e)total count of records with result as Pass,<br>
f)total count of records with result as Fail***<br>

***Create table student(id number,name varchar2(10),subject varchar2(10),result varchar2(10));<br>
insert into student values(1,'A','Maths','Pass');<br>
insert into student values(1,'A','Phy','Pass');<br>
insert into student values(1,'A','Chem','Fail');<br>
insert into student values(1,'A','Chem','Fail');<br>
insert into student values(2,'B','Maths','Pass');<br>
insert into student values(2,'B','Phy','Fail');<br>
insert into student values(2,'B','Chem','Fail');<br>
insert into student values(3,'C','Maths','Pass');<br>
insert into student values(3,'C','Phy','Pass');<br>
insert into student values(3,'C','Chem','Fail');***

In [66]:
%sql Create table student(id number,name varchar2(10),subject varchar2(10),result varchar2(10));insert into student values(1,'A','Maths','Pass');insert into student values(1,'A','Phy','Pass');insert into student values(1,'A','Chem','Fail');insert into student values(1,'A','Chem','Fail');insert into student values(2,'B','Maths','Pass');insert into student values(2,'B','Phy','Fail');insert into student values(2,'B','Chem','Fail');insert into student values(3,'C','Maths','Pass');insert into student values(3,'C','Phy','Pass');insert into student values(3,'C','Chem','Fail');
%sql select * from student;

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
 * sqlite://
Done.

[(1, 'A', 'Maths', 'Pass'),
 (1, 'A', 'Phy', 'Pass'),
 (1, 'A', 'Chem', 'Fail'),
 (1, 'A', 'Chem', 'Fail'),
 (2, 'B', 'Maths', 'Pass'),
 (2, 'B', 'Phy', 'Fail'),
 (2, 'B', 'Chem', 'Fail'),
 (3, 'C', 'Maths', 'Pass'),
 (3, 'C', 'Phy', 'Pass'),
 (3, 'C', 'Chem', 'Fail')]

In [67]:
# solution

# a)the total count of records,

%sql select count(1) from student;

 * sqlite://
Done.

[(10,)]

In [71]:
# b)total count of records with subject as Maths
%sql select subject,count(1) as '# od records' from student where subject='Maths';

 * sqlite://
Done.

[('Maths', 3)]

In [73]:
# c)total count of records with subject as Phy,
%sql select subject,count(1) as '# od records' from student where subject='Phy';

 * sqlite://
Done.

[('Phy', 3)]

In [75]:
# d)total count of records with subject as Chem,
%sql select subject,count(1) as '# od records' from student where subject='Chem';

 * sqlite://
Done.

[('Chem', 4)]

In [77]:
# e)total count of records with result as Pass,
%sql select result,count(1) from student where result='Pass';

 * sqlite://
Done.

[('Pass', 5)]

In [78]:
# f)total count of records with result as Fail
%sql select result,count(1) from student where result<>'Pass';

 * sqlite://
Done.

[('Fail', 5)]

In [80]:
%sql drop table student;

 * sqlite://
Done.

[]

<hr>

## Q10.Write an SQL query to find the total number of students  
***a)who has scored marks greater than equal to 80<br>
b)who has scored less than equal to 90<br>
c)who has scored marks greater than 50 but less than 95<br>
d)who has scored marks greater than equal to 50 and less than equal to 95***<br>

***Create table Student(Studid number,NAME varchar2(10),Subject varchar2(20),marks number);<br>
insert into student values(1,'A','Phy','90');<br>
insert into student values(1,'A','Che','95');<br>
insert into student values(2,'B','Phy','80');<br>
insert into student values(2,'B','Che','85');<br>
insert into student values(3,'C','Phy','90');<br>
insert into student values(4,'D','Phy','75');<br>
insert into student values(4,'D','Che','90');<br>
insert into student values(5,'E','Che','95');***<br>

In [81]:
%sql Create table Student(Studid number,NAME varchar2(10),Subject varchar2(20),marks number);insert into student values(1,'A','Phy','90');insert into student values(1,'A','Che','95');insert into student values(2,'B','Phy','80');insert into student values(2,'B','Che','85');insert into student values(3,'C','Phy','90');insert into student values(4,'D','Phy','75');insert into student values(4,'D','Che','90');insert into student values(5,'E','Che','95');
%sql select * from student;

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
 * sqlite://
Done.

[(1, 'A', 'Phy', 90),
 (1, 'A', 'Che', 95),
 (2, 'B', 'Phy', 80),
 (2, 'B', 'Che', 85),
 (3, 'C', 'Phy', 90),
 (4, 'D', 'Phy', 75),
 (4, 'D', 'Che', 90),
 (5, 'E', 'Che', 95)]

In [87]:
# solution

# a)who has scored marks greater than equal to 80
%sql select count(1) as 'Total # of students scoring >=80 ' from student where marks >= 80;

 * sqlite://
Done.

[(7,)]

In [86]:
# b)who has scored less than equal to 90
%sql select count(1) as 'Total # of students scoring < 90 ' from student where marks <= 90;

 * sqlite://
Done.

[(6,)]

In [90]:
# c)who has scored marks greater than 50 but less than 95
%sql select count(1) as 'Total # of students scoring > 50 < 95 ' from student where marks between 51 and 94;

 * sqlite://
Done.

[(6,)]

In [91]:
# d)who has scored marks greater than equal to 50 and less than equal to 95
%sql select count(1) as 'Total # of students scoring >= 50 <= 95 ' from student where marks between 50 and 95;

 * sqlite://
Done.

[(8,)]